test_examples/tube_OpenFoam3d_abaqus3d/Test_pointDisplacement/0/ccy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ccy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
6144
(
-0.0021875
-0.0021875
-0.0021875
-0.0021875
-0.0021875
-0.0021875
-0.0021875
-0.0021875
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
-0.0021875
-0.001875
-0.0015625
-0.00125
-0.0009375
-0.000625
-0.0003125
5.51454e-21
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
-0.0021875
-0.001875
-0.0015625
-0.00125
-0.0009375
-0.000625
-0.0003125
5.51454e-21
...
)
;
    }
    mantle
    {
        type            calculated;
        value           nonuniform List<scalar> 
1536
(
-0.00495196
-0.00476166
-0.00438837
-0.00384644
-0.00315669
-0.00234563
-0.00144443
-0.000487726
...
)
;
    }
}


// ************************************************************************* //
