test_examples/tube_OpenFoam3d_abaqus3d/Test_pointDisplacement/0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    location    "0.01";
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField  uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
	value		uniform (0 0 0);
    }

    outlet
    {
        type            fixedValue;
	value		uniform (0 0 0);
    }

    mantle
    {
        type            fixedValue;
	value		 nonuniform List<vector>
	1568
	(
	(0 0.0005 0)
	(0 0.0005 0)
	(0 0.0005 0)
	(0 0.0005 0)
	(0 0.0005 0)
	(0 0.0005 0)
	(0 0.0005 0)
	(0 0.0005 0)
...
	);
    }
}
